; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v4)
		(pred_4 ?v1)
		(pred_6 ?v6)
		(pred_2 ?v6)
		(pred_3 ?v1 ?v6)
		(pred_1)
		(pred_5 ?v1))

   (:action op_3
       :parameters  (?v2 ?v8)
       :precondition (and (not-eq ?v2 ?v8) 
                          (pred_6 ?v2) (pred_6 ?v8) (pred_2 ?v2))
       :effect (and  (pred_2 ?v8)
		     (not (pred_2 ?v2))))


   (:action op_2
       :parameters (?v7 ?v3)
       :precondition  (and  (pred_4 ?v7) (pred_6 ?v3)
			    (pred_3 ?v7 ?v3) (pred_2 ?v3) (pred_1))
       :effect (and (pred_5 ?v7)
		    (not (pred_3 ?v7 ?v3)) 
		    (not (pred_1))))

   (:action op_1
       :parameters  (?v7  ?v3)
       :precondition  (and  (pred_4 ?v7) (pred_6 ?v3)
			    (pred_5 ?v7) (pred_2 ?v3))
       :effect (and (pred_3 ?v7 ?v3)
		    (pred_1)
		    (not (pred_5 ?v7)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_04 obj_01 obj_05 obj_06 obj_07 
          obj_03 obj_08 obj_02 
)
(:init
(pred_6 obj_04)
(pred_6 obj_01)
(pred_6 obj_05)
(pred_6 obj_06)
(pred_6 obj_07)
(pred_4 obj_03)
(pred_4 obj_08)
(pred_4 obj_02)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(pred_1)
(pred_3 obj_03 obj_01)
(pred_3 obj_08 obj_01)
(pred_3 obj_02 obj_01)
(pred_2 obj_01)
)
(:goal
(and
(pred_3 obj_03 obj_04)
(pred_3 obj_08 obj_07)
(pred_3 obj_02 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_03 obj_04) (pred_2 obj_05))
    (sometime-before  (pred_3 obj_08 obj_07) (pred_2 obj_04))
    (sometime-before  (pred_3 obj_02 obj_06) (pred_2 obj_04))
  )
)
)

; plan
1. (op_2 obj_08 obj_01)
   deleted: (pred_3 obj_08 obj_01) (pred_1)
   added: (pred_5 obj_08)
   goals met: 0 of 3
2. (op_3 obj_01 obj_05)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_05)
   goals met: 0 of 3
3. (op_1 obj_08 obj_05)
   deleted: (pred_5 obj_08)
   added: (pred_3 obj_08 obj_05) (pred_1)
   goals met: 0 of 3
4. (op_3 obj_05 obj_01)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_01)
   goals met: 0 of 3
5. (op_2 obj_03 obj_01)
   deleted: (pred_3 obj_03 obj_01) (pred_1)
   added: (pred_5 obj_03)
   goals met: 0 of 3
6. (op_3 obj_01 obj_04)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_04)
   goals met: 0 of 3
7. (op_1 obj_03 obj_04)
   deleted: (pred_5 obj_03)
   added: (pred_3 obj_03 obj_04) (pred_1)
   goals met: 1 of 3
8. (op_3 obj_04 obj_01)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_01)
   goals met: 1 of 3
9. (op_2 obj_02 obj_01)
   deleted: (pred_3 obj_02 obj_01) (pred_1)
   added: (pred_5 obj_02)
   goals met: 1 of 3
10. (op_3 obj_01 obj_06)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_06)
   goals met: 1 of 3
11. (op_1 obj_02 obj_06)
   deleted: (pred_5 obj_02)
   added: (pred_3 obj_02 obj_06) (pred_1)
   goals met: 2 of 3
12. (op_3 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_05)
   goals met: 2 of 3
13. (op_2 obj_08 obj_05)
   deleted: (pred_3 obj_08 obj_05) (pred_1)
   added: (pred_5 obj_08)
   goals met: 2 of 3
14. (op_3 obj_05 obj_07)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_07)
   goals met: 2 of 3
15. (op_1 obj_08 obj_07)
   deleted: (pred_5 obj_08)
   added: (pred_3 obj_08 obj_07) (pred_1)
   goals met: 3 of 3
